bit-finance/InformationRegisters/бит_НазначениеДополнительныхИзмерений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_НазначениеДополнительныхИзмерений</Name>
			<Comment>(БИТ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Синоним</Name>
					<Comment>Синоним</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аналитика</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДополнительныхАналитик</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обязательное</Name>
					<Comment>Обязательное</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяТипаПоУмолчанию</Name>
					<Comment>Тип значения по умолчанию для аналитики составного типа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяИзмерения</Name>
					<Comment>Имя измерения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

bit-finance/InformationRegisters/бит_НазначениеДополнительныхИзмерений/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	бит_РаботаСДиалогамиСервер.ФормаЗаписиРегистраПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);
	
	ЭтоСемействоБП	 = бит_ОбщегоНазначения.ЭтоСемействоБП();
	ТекущаяАналитика = Запись.Аналитика;
	
	Если Параметры.Ключ.Пустой() Тогда
		Элементы.ИмяИзмерения.СписокВыбора.ЗагрузитьЗначения(ИзмеренияБюджетирования(Истина));
		Если Элементы.ИмяИзмерения.СписокВыбора.Количество() = 0 Тогда
			ТекстСообщения = НСтр("ru = 'Все аналитики заняты. Редактируйте назначенные.'; 
								|en = 'All the analysts are busy. Edit the assigned ones.'");
			ВызватьИсключение ТекстСообщения;		
		КонецЕсли;
		
		Если ПустаяСтрока(Запись.ИмяИзмерения) Тогда
			Запись.ИмяИзмерения = Элементы.ИмяИзмерения.СписокВыбора[0].Значение;			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Запись.Аналитика) Тогда
			УстановитьСписокВыбораТипуПоУмолчанию();
			Если АналитикаСоставногоТипа Тогда
				Запись.ИмяТипаПоУмолчанию = Элементы.ИмяТипаПоУмолчанию.СписокВыбора[0].Значение;
			КонецЕсли;
		КонецЕсли;
		
		УправлениеФормой(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	Если бит_МеханизмДопИзмерений.ЕстьДвиженияПоАналитике(Запись.ИмяИзмерения, Истина, "") Тогда
		ДоступОграничен = Истина;
	КонецЕсли;
	
	Элементы.ИмяИзмерения.СписокВыбора.ЗагрузитьЗначения(ИзмеренияБюджетирования(Ложь));
	УстановитьСписокВыбораТипуПоУмолчанию();
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АналитикаПриИзменении(Элемент)
	
	Если ВидАналитикиВыбранПравильно() Тогда
		Если Запись.Аналитика <> ТекущаяАналитика Тогда
			Запись.Синоним = Запись.Аналитика;
		КонецЕсли;
		Запись.ИмяТипаПоУмолчанию = "";
		
		УстановитьСписокВыбораТипуПоУмолчанию();
		
		Если НЕ ЗначениеЗаполнено(Элементы.ИмяТипаПоУмолчанию.СписокВыбора) Тогда
			Пояснение = НСтр("ru = 'В составе типов обнаружены примитивные типы. Допускаются только ссылочные типы.'; 
							 |en = 'As part of the type found primitive types. Allowed only reference types.'");
			
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("ПОЛЕ" , "Корректность", 
								НСтр("ru = 'Аналитика'; en = 'Dimension'"),,, Пояснение);
								
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "Аналитика", "Запись");					
		КонецЕсли;	
		
		Если АналитикаСоставногоТипа Тогда
			Запись.ИмяТипаПоУмолчанию = Элементы.ИмяТипаПоУмолчанию.СписокВыбора[0].Значение;
		КонецЕсли;
	Иначе
		Запись.Аналитика = ПредопределенноеЗначение("ПланВидовХарактеристик.бит_ВидыДополнительныхАналитик.ПустаяСсылка");
		Запись.ИмяТипаПоУмолчанию = "";
		АналитикаСоставногоТипа   = Ложь;
	КонецЕсли;
	
	ТекущаяАналитика = Запись.Аналитика;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Элементы = Форма.Элементы;
	Запись	 = Форма.Запись;
	
	Элементы.Аналитика.ТолькоПросмотр	 	   = Форма.ДоступОграничен;
	Элементы.ИмяИзмерения.ТолькоПросмотр	   = Форма.ДоступОграничен;
	Элементы.ИмяТипаПоУмолчанию.ТолькоПросмотр = Форма.ДоступОграничен ИЛИ НЕ Форма.АналитикаСоставногоТипа;
	Элементы.ДекорацияПредупреждение.Видимость = Форма.ДоступОграничен;
	
КонецПроцедуры

&НаСервере
Функция ИзмеренияБюджетирования(ЭтоНовый)

	ИзмеренияБюджетирования = бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Дополнительные", "Синоним", "Массив");

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИмяИзмерения", Запись.ИмяИзмерения);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НазначениеИзмерений.ИмяИзмерения КАК ИмяИзмерения
	|ИЗ
	|	РегистрСведений.бит_НазначениеДополнительныхИзмерений КАК НазначениеИзмерений
	|ГДЕ
	|	ИСТИНА";
	
	Если НЕ ЭтоНовый Тогда
		ЧтоЗаменить	  = "ИСТИНА";
		НаЧтоЗаменить = "НазначениеИзмерений.ИмяИзмерения <> &ИмяИзмерения";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ЧтоЗаменить, НаЧтоЗаменить);	
	КонецЕсли;
	
	РезультатЗапроса	   = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РезультаПоиска = ИзмеренияБюджетирования.Найти(ВыборкаДетальныеЗаписи.ИмяИзмерения);
		Если РезультаПоиска <> Неопределено  Тогда
			ИзмеренияБюджетирования.Удалить(РезультаПоиска);		
		КонецЕсли;
	КонецЦикла;

	Возврат ИзмеренияБюджетирования;

КонецФункции
 
&НаКлиенте
Функция ВидАналитикиВыбранПравильно()

    Правильно = Истина;
    // ВАЖНО. При переносе в ЕРП нужно вернуть ИСТИНА.
    
	Если ЭтоСемействоБП Тогда
               	
    	Мернеджер = "ПланВидовХарактеристик.бит_ВидыДополнительныхАналитик.";
    	Зарезвированные = Новый Массив(); 
    	Зарезвированные.Добавить(ПредопределенноеЗначение(Мернеджер + "ПлатежнаяПозиция"));
    	Зарезвированные.Добавить(ПредопределенноеЗначение(Мернеджер + "Проект"));
    	Зарезвированные.Добавить(ПредопределенноеЗначение(Мернеджер + "СтатьяОборотов"));
    	Зарезвированные.Добавить(ПредопределенноеЗначение(Мернеджер + "ЦФО"));
    	Зарезвированные.Добавить(ПредопределенноеЗначение(Мернеджер + "НоменклатурнаяГруппа"));
    	Зарезвированные.Добавить(ПредопределенноеЗначение(Мернеджер + "Контрагент"));
    	Зарезвированные.Добавить(ПредопределенноеЗначение(Мернеджер + "ДоговорКонтрагента"));
    	Зарезвированные.Добавить(ПредопределенноеЗначение(Мернеджер + "БанковскийСчет"));
    	
    	Если Зарезвированные.Найти(Запись.Аналитика) <> Неопределено Тогда
    		Правильно = Ложь;
    		ТекстСообщения = НСтр("ru='Этот вид аналитики не поддерживается в дополнительных измерениях.';
								  |en='This kind of intelligence is not supported in the extra dimensions.'");
    		ПоказатьПредупреждение(,ТекстСообщения);	
    	КонецЕсли; 
        
    КонецЕсли;

	Возврат Правильно;
	
КонецФункции

&НаСервере
Процедура УстановитьСписокВыбораТипуПоУмолчанию()

	ЗначенияСписка = РегистрыСведений.бит_НазначениеДополнительныхИзмерений.ТипыДополнительнойАналитики(Запись.Аналитика); 
	Элементы.ИмяТипаПоУмолчанию.СписокВыбора.ЗагрузитьЗначения(ЗначенияСписка);
	АналитикаСоставногоТипа = ЗначенияСписка.Количество() > 1;
		
КонецПроцедуры

#КонецОбласти
